{
    "Covid_situation.R0": "Under the rules currently in place, you must require the employee to comply with health guidelines, including the full use of the procedure mask or other safety equipment in the workplace.",
    "Covid_situation.R1": "You must explain to the employee that refusing to wear required safety equipment, in this case the procedure mask, is a violation of his or her obligations at work. \n\nAn employee who persists in refusing to properly wear the procedure mask in the workplace is being insubordinate. Therefore, you must remind the recalcitrant employee of the legal requirement.",
    "Covid_situation.R2": "Failure to comply with this requirement will result in the employee being sent home under suspension. You must also instruct the employee to return to work the next day with the mask properly worn.",
    "Covid_situation.R3": "In addition, it should be noted that the obligation provided by the legislator does not contain an exception for the wearing of masks for vaccinated people. The employee must therefore be treated like everyone else and comply with the health regulations, under pain of progressive disciplinary sanctions.",
    "Covid_situation.R4": "It is generally recommended that a health guideline be adopted and communicated within the organization. \n\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any.\n\nFor more information on the application of health measures, please consult the following government resources:\n\n- Government of Quebec: https://www.quebec.ca/sante/problemes-de-sante/a-z/coronavirus-2019/consignes-entreprises\n\n- CNESST: https://www.cnesst.gouv.qc.ca/fr/prevention-securite/coronavirus-covid-19/trousse-covid-19-guide-outils\n\nINSPQ: https://www.inspq.qc.ca/sites/default/files/publications/3022-hierarchie-mesures-controle-milieux-travail-covid19.pdf",
    "Covid_situation.R5": "If the employee mentions that he or she needs reasonable accommodation, be a good listener. You may, at your discretion, take reasonable steps to help the employee at this level. For example, you could make changes to the employee's position so that the health or safety of others is not compromised (e.g.: a position that limits physical contact with others or allow remote work, if possible). \n\nYou may require the employee to provide a document attesting to the situation.",
    "Covid_situation.R6": "If the employee says he or she has a medical condition preventing him or her from wearing a procedural mask, you must require him or her to provide a document signed by a physician that explains why there is an exception for the employee.\n\nIf the employee provides such medical evidence, you must ensure the reliability of that document and make reasonable accommodations for that employee in a manner that respects the health and safety of others.",
    "Covid_situation.R7": "Okay, given the information shared today, here are the options available to you:\n\n- Request that the employee provides medical evidence regarding the exemption from wearing a procedural (surgical) mask as soon as possible. \n\n- If the employee fails to provide medical proof and still refuses to comply with the mask-wearing requirement, you may administer a 1-5 day suspension.",
    "Covid_situation.R8": "Alright, given the shared information today, here are the options available to you. Please note that this recommendation takes into account the employee's actions severity, gravity and the past sanction gradation applicable to the past employment record.",
    "Covid_situation.R9": "Verbal warning",
    "Covid_situation.R10": "Written warning",
    "Covid_situation.R11": "1 day suspension",
    "Covid_situation.R12": "2 day suspension",
    "Covid_situation.R13": "3 day suspension",
    "Covid_situation.R14": "4 day suspension",
    "Covid_situation.R15": "5 day suspension",
    "Covid_situation.R16": "You will also need to make it clear to the employee that failure to follow the instruction to wear properly a procedure mask will result in increasingly severe suspensions up to the termination of employment.",
    "Covid_situation.R17": "WARNING: If the employee who refuses to wear the procedure (surgical) mask shows symptoms related to COVID-19, be vigilant and careful. You should also inform the employee's co-workers that they should not report to work and should isolate themselves if they have symptoms associated with COVID-19. \n\nYou have the right to require employees with symptoms associated with COVID-19 to be tested for COVID-19. Employees must test negative for COVID-19 to return to work. \n\nA non-exhaustive list of symptoms commonly associated with COVID-19:\n- Dry cough\n- Fever\n- Severe fatigue\n- Difficulty breathing or shortness of breath\n- Loss of smell or taste",
    "Covid_situation.R18": "In addition, if employees exercise their right to refuse to work with the employee in question, because of a danger to their health or safety, you will have to call in a CNESST inspector to make a decision on the matter.",
    "Covid_situation.R19": "It is not recommended to dismiss an employee, having more than 2 years of continuous service, without following a certain gradation of sanctions, ranging from a written warning, to increasingly severe suspensions until dismissal. Unless there is a very serious offense or the employee has a very loaded disciplinary file.\n\nOtherwise it is better to be prudent and proceed with a gradation of disciplinary sanctions. It must be shown that all the sanctions were applied gradually and that the employee was invited to change his behaviour.",
    "Covid_situation.R20": "Since the employee has less than 2 years of continuous service and according to the severity of the incident and the personal disciplinary record, you may:\nM) Proceed with the progressive disciplinary sanctions \nO) Terminate the employment",
    "Covid_situation.R21": "An employer who does not give sufficient notice of termination of employment must pay the worker an indemnity. The indemnity must be equal to the regular wages they would have earned between the date on which the notice should have been provided and the termination of their employment. Overtime must not be included when calculating the indemnity.\n\nPlease note that the annual vacation period may not be included in the notice period, and that the worker's benefits must be maintained during the notice period. \n\n\nUnless there has been a serious fault, the law requires that you give a written notice terminating the employment of an employee. \n\nThe length of the notice varies depending on the length of uninterrupted service of the employee with the employer.\n\n- < 3 mths = no notice\n- 3 mths < ServYrs < 12 mths = 1 week notice\n- 12 mths < ServYrs < 60 mths = 2 weeks notice\n- 60 mths < ServYrs < 120 mths = 4 weeks notice\n- ServYrs > 121 mths = 8 weeks notice\n\nReferences: Act respecting labour standards, section. 82, 82.1 and 83.\n\n\nWarning: Please note that the indemnity provided for by the Act respecting labour standards is a minimum and that an employee can claim, in theory, a more generous indemnity in certain cases under the Civil Code of Quebec (art. C.c.Q 2091).\n\nIn exchange, you could ask the employee to sign a waiver of his rights. However, the employee has no obligation to sign such a waiver. \n\nRemember that you must also give to the employee the amounts owed to him (for example pay, overtime, vacation pay).",
    "Covid_situation.R22": "According to the law currently in effect in Quebec, a person is not obliged to be vaccinated if he or she does not wish to do so. \n\nSince the employee who refuses to be vaccinated is within his or her rights, he or she should be directed to resources and information about vaccines to try to change his or her mind about vaccination.",
    "Covid_situation.R23": "If the work environment deteriorates due to an employee's refusal to be vaccinated, you may want to consider setting up the following solutions: \n\n- Provide information about available protective equipment and preventive measures against infectious diseases.\n\n- Educate and sensitize employees about the personal protection provided by vaccination.\n\n- Require compliance with health guidelines, including full-face masks or other safety equipment in the workplace.",
    "Covid_situation.R24": "If the situation does not improve with education and information, or worse, escalates, you may want to consider hiring a mediator, especially to act preventively within the work team.",
    "Covid_situation.R25": "You may also want to require all unvaccinated employees to be screened weekly, if not every two weeks, since they pose a greater health risk to others than vaccinated employees.",
    "Covid_situation.R26": "In addition, if employees exercise their right to refuse to work with the employee in question, because of a danger to their health or safety, you will have to call in a CNESST inspector to make a decision on the matter.",
    "Covid_situation.R27": "In addition, it is generally recommended that a health guideline be adopted and communicated within the organization. \n\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any.\n\nFor more information on the application of health measures, please consult the following government resources:\n\n- Government of Quebec: https://www.quebec.ca/sante/problemes-de-sante/a-z/coronavirus-2019/consignes-entreprises\n\n- CNESST: https://www.cnesst.gouv.qc.ca/fr/prevention-securite/coronavirus-covid-19/trousse-covid-19-guide-outils\n\nINSPQ: https://www.inspq.qc.ca/sites/default/files/publications/3022-hierarchie-mesures-controle-milieux-travail-covid19.pdf",
    "Covid_situation.R28": "If the employee mentions that he or she needs reasonable accommodation, be a good listener. You may, at your discretion, take reasonable steps to help the employee at this level. For example, you could make changes to the employee's position so that the health or safety of others is not compromised (e.g.: a position that limits physical contact with others or allow remote work, if possible). \n\nYou may require the employee to provide a document attesting to the situation.",
    "Covid_situation.R29": "If the employee says he or she has a medical condition preventing him or her from being vaccinated, you must require him or her to provide a document signed by a physician that explains why there is an exception for the employee.\n\nIf the employee provides such medical evidence, you must ensure the reliability of that document and make reasonable accommodations for that employee in a manner that respects the health and safety of others."
}