{
    "Covid_situation.R22": "According to the law currently in effect in Quebec, a person is not obliged to be vaccinated if he or she does not wish to do so. \n\nSince the employee who refuses to be vaccinated is within his or her rights, he or she should be directed to resources and information about vaccines to try to change his or her mind about vaccination.",
    "Covid_situation.R23": "If the work environment deteriorates due to an employee's refusal to be vaccinated, you may want to consider setting up the following solutions: \n\n- Provide information about available protective equipment and preventive measures against infectious diseases.\n\n- Educate and sensitize employees about the personal protection provided by vaccination.\n\n- Require compliance with health guidelines, including full-face masks or other safety equipment in the workplace.",
    "Covid_situation.R24": "If the situation does not improve with education and information, or worse, escalates, you may want to consider hiring a mediator, especially to act preventively within the work team.",
    "Covid_situation.R25": "You may also want to require all unvaccinated employees to be screened weekly, if not every two weeks, since they pose a greater health risk to others than vaccinated employees.",
    "Covid_situation.R26": "In addition, if employees exercise their right to refuse to work with the employee in question, because of a danger to their health or safety, you will have to call in a CNESST inspector to make a decision on the matter.",
    "Covid_situation.R27": "In addition, it is generally recommended that a health guideline be adopted and communicated within the organization. \n\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any.\n\nFor more information on the application of health measures, please consult the following government resources:\n\n- Government of Quebec: https://www.quebec.ca/sante/problemes-de-sante/a-z/coronavirus-2019/consignes-entreprises\n\n- CNESST: https://www.cnesst.gouv.qc.ca/fr/prevention-securite/coronavirus-covid-19/trousse-covid-19-guide-outils\n\nINSPQ: https://www.inspq.qc.ca/sites/default/files/publications/3022-hierarchie-mesures-controle-milieux-travail-covid19.pdf",
    "Covid_situation.R28": "If the employee mentions that he or she needs reasonable accommodation, be a good listener. You may, at your discretion, take reasonable steps to help the employee at this level. For example, you could make changes to the employee's position so that the health or safety of others is not compromised (e.g.: a position that limits physical contact with others or allow remote work, if possible). \n\nYou may require the employee to provide a document attesting to the situation.",
    "Covid_situation.R29": "If the employee says he or she has a medical condition preventing him or her from being vaccinated, you must require him or her to provide a document signed by a physician that explains why there is an exception for the employee.\n\nIf the employee provides such medical evidence, you must ensure the reliability of that document and make reasonable accommodations for that employee in a manner that respects the health and safety of others."
}