{
  "annual_vacation.R1":"It's generally recommended, but not required by law, to write a policy on absences and leaves, and make sure to communicate it to all the employees.Make sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include: General goals of the policy Roles and responsibilities of the parties General conditions for taking leave from work Rules and procedures, i.e.:  - Employee's obligations (e.g.: to notify the supervisor in advance) - Concrete actions to be taken  - Documents to be completed or provided - Deadlines for taking actions - Possible disciplinary sanctions in case of non-compliance",
  
  "annual_vacation.R2":"Make sure that your policy replicates the rules concerning annual vacation.",
  
  "annual_vacation.R3":"Workers, whether full-time or part-time, are entitled to vacation time each year and to an allowance, commonly referred to as vacation pay. \nTo establish the length of vacation and calculate the amount of pay, the employer must take into account 3 factors: \n- the reference year used in its company to establish vacation entitlement;\n- the number of years of continuous service of the employee; \n- the gross salary earned during the reference year. \nVacation time is accumulated over a 12-month period, called the reference year. The worker must take his or her vacation in the twelve months following the end of the reference year unless agreed otherwise with the employer.\nIn most cases, the reference year runs from May 1 to April 30. The period may be different if the employer, a decree or a collective agreement sets other dates.\nReference: Act respecting labour standards, sections 66 and 70.",
  
  "annual_vacation.R4":"Annual vacation pay is based on the number of years of continuous service at the end of the reference year.\nThe amount of vacation pay is calculated on the basis of the gross salary earned during the reference year (4% or 6%).  \nVacation time and pay based on continuous service: \n- less than one year of continuous service is entitled to a continuous vacation of one working day for each month of continuous service not to exceed two weeks.\n- at least one year to less than three years of continuous service is entitled to a continuous leave of two weeks.\n- at least three years of continuous service is entitled to a continuous leave of three weeks.\nNote: An employee with at least one year to three years of continuous service is entitled to an additional week of vacation without pay if requested. However, the additional week of vacation may not be continuous with the two weeks already provided.\nReferences: Loi sur les normes du travail, sections 68, 68.1, 69. ",
  
  "annual_vacation.R5":"The indemnity relating to annual vacation  is 4% of gross wages earned during the reference year for an employee with less than three years of  uninterrupted service. It is 6% of gross wages for an employee with more than three years of uninterrupted service. \nThe employee must receive the annual vacation pay in a lump sum before the beginning of the vacation or  in the manner applicable for the regular payment of his or her wages. \nIn addition, the employer is prohibited from replacing the vacation with a compensatory allowance, except as provided by law. \nReferences: Act respecting labour standards, sections 73., 74. et 75. ",
  
  "annual_vacation.R6":"In addition, you have the right to determine the timing of the vacation. However, the employee is entitled to know the date of his annual vacation at least four weeks in advance. \nReference: Act respecting labour standards, section 72.",
  
  "event_not_covered.R1":"It's generally recommended to write a policy on absences and leaves, and make sure to communicate it to all the employees.\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include: \n General goals of the policy \n Roles and responsibilities of the parties \n General conditions for taking leave from work \n Rules and procedures, i.e.: \n - Employee's obligations (e.g.: to notify the supervisor in advance) \n - Concrete actions to be taken \n - Documents to be completed or provided \n - Deadlines for taking actions",
  
  "event_not_covered.R2":"Make sure that your policy replicates the rules concerning leave from work.",
  
  "event_not_covered.R3":"The law does not require you to grant leave for the following personal events: \n- divorce \n- move \n- birthday \nIn fact, the Act respecting labour standards does not provide leave, with or without pay, for employees who wish to be absent for the personal events mentioned above. \nYou may or may not grant leave to the employee who requests it.  \nReference: https://www.cnesst.gouv.qc.ca/fr/conditions-travail/conges/evenements-sans-conges-prevu-par-loi",
  
  "wedding_or_civil.R1":"It's generally recommended, but not required by law, to write a policy on absences and leaves, and make sure to communicate it to all the employees.\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include: \n  General goals of the policy\n  Roles and responsibilities of the parties\n  General conditions for taking leave from work\n  Rules and procedures, i.e.: \n  - Employee's obligations (e.g.: to notify the supervisor in advance)\n  - Concrete actions to be taken \n  - Documents to be completed or provided\n  - Deadlines for taking actions\n  - Possible disciplinary sanctions in case of non-compliance",
  
  "wedding_or_civil.R2":"Make sure that your policy replicates the rules concerning leave from work.",
  
  "wedding_or_civil.R3":"An employee may be absent from work for one day with pay, the day of his or her wedding or civil union?\nReference: Act respecting labour standards, section 81. ",
  
  "wedding_or_civil.R4":"However, the employee must advise the employer of his absence not less than one week in advance.\nReference: Act respecting labour standards, section 81. ",
  
  "wedding_or_civil.R5":"You also have the right to ask the employee to provide a document attesting to the wedding or civil union.",
  
  "parental_leave.R1":"It's generally recommended, but not required by law, to write a policy on absences and leaves, and make sure to communicate it to all the employees.\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include:  \n  General goals of the policy \n  Roles and responsibilities of the parties\n  General conditions for taking leave from work \n  Rules and procedures, i.e.: \n  - Employee's obligations (e.g.: to notify the supervisor in advance)\n  - Concrete actions to be taken \n  - Documents to be completed or provided\n  - Deadlines for taking actions\n  - Possible disciplinary sanctions in case of non-compliance",
  
  "parental_leave.R2":"Make sure that your policy replicates the rules concerning leave from work.",
  
  "parental_leave.R3":"According to ALS 79.6.1. and 79.7, the employee can be absent from work for 10 days per civil year (including a maximum of 2 paid days) to: \n- fulfil obligations related to the care, health or education of the employee's child or the child of the employee's spouse;\n- because of the state of health of his or her spouse, father, mother, brother, sister or one of the grandparents for whom the employee acts as a caregiver.\nReference: Act respecting labour standards, sections 76.6.1 and 79.7. \nThe employee must notify the employer of the absence as soon as possible and take reasonable steps to limit the taking and duration of the leave.\n If you authorized, it is also possible to divide the days of absence according to the number of hours of absence.\n These days of leave cannot be carried over from one year to the next and they cannot be cashed in.\nReference: Act respecting labour standards, section 79.7.",
  
  "parental_leave.R4":"The first two days taken annually shall be remunerated in the same way as for the indemnity for statutory holidays, with any adjustments required in the case of division of days of absence, namely:\n1/20 of the wages earned during the 4 complete weeks of pay preceding the week of the absence, excluding overtime.\n 1/60 of the wages earned during the 12 complete weeks of pay preceding the week of the absence, for the person remunerated in whole or in part by commission.\n However, to benefit from this remuneration for a day of absence the employee must have 3 months of continuous service.\n Reference: Act respecting labour standards, sections 79.7. and 62.",
  
  "parental_leave.R5":"The employer also has the right to ask the employee, if it is warranted, particularly due to the length of the absence, to furnish a document attesting to the reasons for the absence. \n Reference: Act respecting labour standards, section 79.7.",
  
  "parental_leave.R6":"By law, an employee may be absent from work without pay: \n - up to 16 weeks over a 12-month period when the employee must stay with a relative or a person for whom the employee acts as a caregiver because of a serious illness or a serious accident \n - up to 27 weeks over a 12-month period if the seriously ill person is suffering from a serious and potentially mortal illness \n - up to 36 weeks over a 12-month period if the seriously ill person or victim of a serious accident is a minor child (under 18 years old)\n However, the employee is entitled to an extension of up to 104 weeks if his or her minor child has a serious and potentially mortal illness or if his or her minor child who suffered serious bodily injury during or resulting directly from a criminal offence that renders the child unable to carry on regular activities. \n Note: The 12-month period is counted from the employee's first absence.\n Reference: Act respecting labour standards, sections 79.8., 79.8.1. and 79.9.",
  
  "parental_leave.R7":"In all cases, you must require the employee to provide you with a medical certificate stating the reasons for an extended absence to care for his or her minor child or a relative because of a serious illness, a serious accident or a life-threatening illness.  \n Reference: Act respecting labour standards, sections 79.8., 79.8.1. and 79.9.",
  
  "parental_leave.R8":"By law, number of days of absence depends on: \n a) Period within 12 months;\nb) Relative's age;\nc) Type of the incident: Natural, criminal act or suicide;\nd) The calculation of remaining days from:\nço  < 16 semaines sur une période de 12 mois\n Si le salarié agit comme proche aidant à une personne majeure (plus que 17 ans) (LNT art. 79.8);\no < 36 semaines sur une période de 12 mois, si le salarié agit comme proche aidant à une personne  (moins que 17 ans) (LNT art. 79.8);\no < 104 semaines sur une période de 12 mois, si\n        L’enfant mineur est atteint d’une maladie grave (mortelle) (LNT art. 79.8);\n         L’enfant mineur a subi un préjudice corporel grave suite à un acte criminel le rendant incapable d’exercer ses activités régulières (LNT art. 79.9);\n        L’enfant a disparu. Si ce enfant est retrouvé avant l’expiration de cette période d’absence, celle-ci prend fin à compter du onzième jour qui suit (LNT art. 79.10); \n        L’enfant mineur décède; (LNT art. 79.10.1);\n        Si son conjoint, son père, sa mère ou son enfant majeur décède par suicide (LNT art. 79.11) ou suite à un acte criminel (LNT art. 79.12)",
  
  "parental_leave.R9":"Relativeof an employee is defined by law as: \n- his or her spouse \n- his or her child or spouse's child\n- his or her parents or the parents of his or her spouse \n- his or her brother, sister or those of his or her spouse \n- his or her grandparents or those of his or her spouse\nIn addition, the law considers the following to be a '' relative '':\n- a person having acted, or acting, as a foster family for the employee or the employee’s spouse\n- a child for whom the employee or the employee’s spouse has acted, or is acting, as a foster family\n- a tutor or curator of the employee or the employee’s spouse or a person under the tutorship or curatorship of the employee or the employee’s spouse\n- an incapable person having designated the employee or the employee’s spouse as mandatary\n- any other person in respect of whom the employee is entitled to benefits under an Act for the assistance and care the employee provides owing to the person’s state of health\nReference: Act respecting labour standards, section 79.6.1.",
  
  
  "parental_leave.R10":"You are not required by law to grant paid leave for parental or family obligations that are unrelated to the need for: \n - fulfil obligations related to the care, health or education of the employee's child or the child of the employee's spouse;\n - fulfil obligations related to the state of health of his or her spouse, father, mother, brother, sister or one of the grandparents for whom the employee acts as a caregiver.\nYou may or may not grant leave to the employee who requests it. \nReference: Act respecting labour standards, sections 79.6.1 and 79.7.",
  
  
  "death_funeral.R1":"It's generally recommended, but not required by law, to write a policy on absences and leaves, and make sure to communicate it to all the employees.\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include: \n  General goals of the policy\n  Roles and responsibilities of the parties\n  General conditions for taking leave from work\n  Rules and procedures, i.e.: \n  - Employee's obligations (e.g.: to notify the supervisor in advance)\n  - Concrete actions to be taken \n  - Documents to be completed or provided\n  - Deadlines for taking actions\n  - Possible disciplinary sanctions in case of non-compliance",
  
  "death_funeral.R2":"Make sure that your policy replicates the rules concerning leave for death or funeral of a relative.",
  
  "death_funeral.R3":"According to ALS 80, the employee is entitled to 5 days of absence from work, including 2 paid days, in the event of the death or funeral of: \n- his or her spouse\n- his or her child\n- the child of his or her spouse\n- his or her father or mother\n- his or her brother or sister\nReference: Act respecting labour standards, section 80.",
  "death_funeral.R4":"In addition, according to ALS 80.1, the employee is entitled to 1 day of absence from work without pay in the event of the death or funeral: \n- of a son-in-law or daughter-in-law- of one of his or her grandparents\n- of one of his or her grandchildren\n- of the father or mother of his or her spouse\n- of a brother or sister of his or her spouse \nReference: Act respecting labour standards, section 80.1.  ",
  "death_funeral.R5":"According to ALS 80.2, in the event of absence due to the death or funeral of a family member, the employee must advise the employer of his absence as soon as possible.\nReference: Act respecting labour standards, section 80.2.",
  "death_funeral.R6":"Finally, it should be noted that the employee is entitled to 104 WEEKS of leave if:\n- his or her minor child dies\n- his or her spouse, adult child or parent commits suicide\n- his or her spouse or adult child dies as a result of a criminal offence\nThe period of absence shall not begin before the date of death and shall not end later than 104 weeks after that date.\nHowever, during the period of absence, the employee may return to work intermittently or on a part-time basis if you consent to it. \nReferences: Act respecting labour standards, sections 79.10.1, 79.11, 79.12 and 79.15.",
  
  "non_work_related.R1":"It's generally recommended to write a policy on absences and leaves, and make sure to communicate it to all the employees.\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include: \n General goals of the policy\n Roles and responsibilities of the parties\n General conditions for taking leave from work\n Rules and procedures, i.e.: \n - Employee's obligations (e.g.: to notify the supervisor in advance)\n - Concrete actions to be taken \n - Documents to be completed or provided\n - Deadlines for taking actions",
  
  "non_work_related.R2":"Make sure that your policy replicates the rules concerning leave from work.",
  
  "non_work_related.R3":"Here is what the law says:\nIf the worker is credited with 3 months or more of uninterrupted service with their employer, the first 2 days of absence are with pay if they are absent for any of the following reasons:\n- owing to sickness or an accident\n- to fulfil family obligations relating to the care, health or education of their child or their spouse’s child \n- to fulfil family obligations as an informal caregiver for a relative or another person owing to their state of health \n- for organ or tissue donation \n- following domestic violence or sexual violence or a criminal offence ",
  
  "non_work_related.R4":"Employees are entitled to a total of 2 days of absence with pay per calendar year (January 1 to December 31). These days of absence may not be deferred from one year to the next or replaced with an indemnity.\nThe division of these days of absence with pay is not provided for in the Act. If the worker is absent for only part of the day due to illness or for another health-related reason, they must take leave without pay. However, they are still entitled to their full days of absence with pay.\nHowever, if authorized by the employer, these days may be divided. In this case, the pay must be calculated based on the number of hours of absence. ",
  
  "non_work_related.R5":"A worker may be absent for an extended period owing to an accident or an illness. They may be absent for 26 weeks without pay over a 12-month period if they are ill or had an accident that is not related to their work and means that they are unable to work.\nThey must advise their employer of their absence as soon as possible.  \nIf warranted by the circumstances, you may ask them to provide an official document attesting to the reasons for the absence and the length of the absence.",
  
  "non_work_related.R6":"The calculation of the indemnity for days of paid absences according to the law is as follows:\n1/20 of the wages earned during the 4 complete weeks of pay preceding the week of the holiday, excluding overtime.\nReference : Act respecting labour standards, section 79.6.1 to 81.17.",
  
  "non_work_related.R7":"To obtain an estimate of the indemnity to be paid for an employee's days of paid absences, you can refer to the CNESST's online tool moncalcul (in english). \nhttps://www.cnesst.gouv.qc.ca/en/node/1117496/moncalcul",
  
  "non_work_related.R8":"Disclaimer\nPlease note that the calculation does not take into account tax deductions and employer bonuses.\nPlease also note that overtime, bonuses and premiums are not counted in the calculation of days of paid absences indemnity.",
  
  "non_work_related.R9":"For the  days of paid absences in question, please do not neglect to pay the employee if applicable:\n- Wages or pay for work performed on the holiday\n- Overtime for work performed on the holiday\n- Statutory holiday indemnity",
  
  "specific_situation.R1":"It's generally recommended to write a policy on absences and leaves, and make sure to communicate it to all the employees.\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include: \n  General goals of the policy\n  Roles and responsibilities of the parties\n  General conditions for taking leave from work\n  Rules and procedures, i.e.: \n  - Employee's obligations (e.g.: to notify the supervisor in advance)\n  - Concrete actions to be taken \n  - Documents to be completed or provided\n  - Deadlines for taking actions",
  "specific_situation.R2":"Make sure that your policy replicates the rules concerning leave from work.",
  "specific_situation.R3":"By law, you are required to grant leave from work, without pay, to a reservist employee of the Canadian Armed Forces who is required to take part in:\n - operations in Canada \n - operations outside Canada\n - annual training\n However, the following conditions apply. \n Reference: Act respecting labour standards, section 81.17.1.",
  "specific_situation.R4":"Operations in Canada\n A reservist may be absent from work, without pay, to take part in a Canadian Forces operation in Canada to: \n - provide assistance in the case of a major disaster within the meaning of the Civil Protection Act\n - provide assistance to the civil power, on request of the Attorney General of Québec under the National Defence Act \n - intervene in any other emergency situation designated by the Government \n - take part in any other operation of the Canadian Armed Forces, according to the circumstances, conditions and duration provided by regulation\n An employee who is absent for one of the above reasons for a period of more than 12 weeks may not be absent again for one of these reasons before the expiry of a period of 12 months from the date of the return to work.\n Reference: Act respecting labour standards, sections 81.17.1 and 81.17.5.",
  "specific_situation.R5":"Operations Outside Canada\n A reservist may take time off work, without pay, to take part in a Canadian Forces operation overseas if they have 12 months of continuous service with your company.\n The overseas operation includes:\n - preparation \n - training\n - rest\n - travel from or to home\n A reservist may be absent from work to take part in a Canadian Forces operation abroad for a maximum period of 18 months. \n An employee who is absent from work to take part in a Canadian Forces operation aboard for a period of more than 12 weeks may not be absent again before the expiry of a period of 12 months from the date of return to work.\n Reference: Act respecting labour standards, sections 81.17.1 and 81.17.15.",
  "specific_situation.R6":"Annual Training \n A reservist may be absent from work, without pay, to take part in the annual training of the Canadian Armed Forces for a maximum period of 15 days (or such other period as may be prescribed by regulation).\n Reference: Act respecting labour standards, section 81.17.1.",
  "specific_situation.R7":"However, an employee shall not be absent from work on leave for a reservist in the following situations:\n - there is a danger to the life, health or security of other employees or the population\n - there is a risk of destruction or serious deterioration of certain property or in a case of superior force\n - the absence is inconsistent with the employee’s professional code of ethics.\n Reference: Act respecting labour standards, section 81.17.2.",
  "specific_situation.R8":"To benefit from leave as a reservist, the employee must notify the employer in writing at least four weeks in advance of the date of the beginning of the absence, the reason for the absence and its duration. \n This period may be shorter if the employee has a serious cause. The employee must notify the employer as soon as possible.\n You are entitled to request the employee to provide any document justifying the absence.\n Reference: Act respecting labour standards, sections 81.17.3 and 81.17.4.",
  "specific_situation.R9":"An employee who returns to work, after a reservist leave, shall retain the same rights as if he or she had worked. In particular, the employee is entitled to:\n - return to his or her regular position\n - Receive the salary and benefits that would have been available to him or her had remained at work\n - retain all rights and privileges in the event of abolition of position, collective dismissal or layoff\n - retain all rights and privileges in the event of absence due to illness, organ or tissue donation, accident, domestic violence, sexual violence or criminal act \n In addition, the employee may return to work earlier than scheduled after giving the employer at least three weeks' written notice of the new date of return to work.\n Reference: Act respecting labour standards, section 81.17.3.",
  "specific_situation.R10":"An employee is entitled to take a leave from work, without pay, on the occasion of a termination of pregnancy, such as a miscarriage or an abortion, to recover.\n Below are the rules and conditions that apply in this situation.\n Reference: Act respecting labour standards, sections 81.5.2 and 81.1.",
  "specific_situation.R11":"Termination of pregnancy before the 20th week \n When the termination of pregnancy occurs before the 20th week of pregnancy, the employee is entitled to a special maternity leave, without pay, for a period no longer than 3 weeks.\n An employee who needs an extended leave must obtain a medical certificate from a physician justifying the need to extend the leave. \n The law does not provide leave for the spouse of the person in this situation.\n Reference: Act respecting labour standards, section 81.5.2",
  "specific_situation.R12":"Termination of pregnancy in or after the 20th week\n When the termination of pregnancy occurs in or after the 20th week of pregnancy, the employee is entitled to maternity leave, without pay, for a maximum of 18 consecutive weeks.\n This leave must end no later than 20 weeks after the week of the event.\n She is also entitled to benefits from the Régime québécois d’assurance parentale (RQAP).\n Reference: Act respecting labour standards, section 81.5.2.",
  "specific_situation.R13":"5-day leave\n In addition, the employee and her spouse are entitled to 5 days leave if the termination of pregnancy occurs from the 20th week of pregnancy.\n The first two days of leave are paid.\n The leave must be taken within the 15 days of the termination of the pregnancy.\n At the request of the father or mother, it is also possible to split this leave into days or hours if you agree.\n Warning:\n If the mother is already on maternity leave, she cannot benefit from this leave.\n Reference: Act respecting labour standards, section 81.1.",
  "specific_situation.R14":"Special maternity leave for an employee with a high-risk pregnancy\n It is important to note that an employee who has not yet given birth is entitled to special maternity leave, without pay, in these following cases:\n - there is a risk of termination of the pregnancy\n - there is a risk to the health of the mother or the unborn child caused by the pregnancy\n In both cases, the danger must require a work stoppage.\n In the event of a work stoppage, the employee must provide a medical certificate attesting to the existing risk and indicating the expected date of delivery.\n If the employee has not returned to work by the beginning of the fourth week before the expected date of delivery, her special maternity leave will become the maternity leave provided by law.\n Warning: This special maternity leave should not be confused with the re-assignment, which is intended for cases where the work performed by the pregnant employee causes a danger.\n Reference: Act respecting labour standards, section 81.5.1.",
  "specific_situation.R15":"In all cases, the employee must, as soon as possible, notify you in writing of her situation.\n In this written notice, the employee must indicate, among other things, the expected date of her return to work and provide a medical certificate.\n Reference: Act respecting labour standards, sections 81.1, 81.5.3 and 81.6.",
  "specific_situation.R16":"Please note that, in all cases, the length of leave remains the same if the worker was expecting twins. It is not multiplied by 2.\n Case law: Syndicat professionnel des scientifiques à pratique exclusive de Montréal v. Montréal (Ville de), D.T.E. 2005T-568 (T.A.)\n Reference: https://www.cnesst.gouv.qc.ca/en/working-conditions/leave/specific-situations/leave-event-termination-pregnancy",
  "specific_situation.R17":"An employee may be absent from work for up to 26 weeks over a 12-month period for organ or tissue donation for a transplant.\n Reference: Act respecting labour standards, section 79.1.",
  "specific_situation.R18":"An employee, who has 3 months of uninterrupted service with your company, could be entitled to 2 days of absence with pay for organ or tissue donation for a transplant. \n However, you are not required to grant the 2 days of absence with pay if these days were used during the year for the following reasons:\n- to fulfil family obligations relating to the care, health or education of their child or their spouse’s child or as an informal caregiver\n- in case of sickness or accident not related to work\n- following a domestic or sexual violence\n- following a criminal offence\n Reference: Act respecting labour standards, sections 79.16, 79.1 and 79.7.",
  "specific_situation.R19":"The employee must advise as soon as possible when he or she is to be absent from work for organ or tissue donation for a transplant.\n You have the right to ask the employee to provide a document attesting to the reason for the absence, If it is warranted by the duration of the absence or its repetitive nature, for instance. \n Reference: Act respecting labour standards, section 79.2.",
  
  "specific_situation.R20":"The employee's regular position and related benefits are protected for the duration of the employee's absence for organ or tissue donation for a transplant, which includes but is not limited to:",
  
  "specific_situation.R21":"An employee may be absent from work for up to 26 weeks over a 12-month period without pay for domestic violence or sexual violence of which the employee has been a victim.Reference: Act respecting labour standards, section 79.1.",
  
  "specific_situation.R22":"An employee, who has 3 months of uninterrupted service with your company, could be entitled to 2 days with pay as a result of domestic or sexual violence.\nHowever, you are not required to grant the 2 days of absence with pay if these days were used during the year for the following reasons:\n- to fulfil family obligations relating to the care, health or education of their child or their spouse’s child or as an informal caregiver\n- in case of sickness or accident not related to work\n- following a domestic or sexual violence\n- following a criminal offence\nReference: Act respecting labour standards, sections 79.16, 79.1 and 79.7.",
  
  "specific_situation.R23":"The employee must advise as soon as possible when he or she is to be absent from work as a result of domestic or sexual violence.\n You have the right to ask the employee to provide a document attesting to the reason for the absence, If it is warranted by the duration of the absence or its repetitive nature, for instance. \n Reference: Act respecting labour standards, section 79.2.",
  
  "specific_situation.R24":"The employee's regular position and related benefits are protected for the duration of the employee's absence as a result of domestic or sexual violence, which includes but is not limited to:",
  
  "specific_situation.R25":"An employee may be absent from work for up to 104 weeks without pay as a result of being a victim of a crime.\nThe employee must have suffered a serious bodily injury during or resulting directly from a criminal offence that renders the employee unable to hold his regular job.\nIn that case, the period of absence shall not begin before the date on which the criminal offence was committed.",
  
  "specific_situation.R26":"An employee, who has 3 months of uninterrupted service with your company, could be entitled to 2 days with pay as a result of being a victim of a crime.\nHowever, you are not required to grant the 2 days of absence with pay if these days were used during the year for the following reasons:\n- to fulfil family obligations relating to the care, health or education of their child or their spouse’s child or as an informal caregiver\n- in case of sickness or accident not related to work\n- following a domestic or sexual violence\n- following a criminal offence\nReference: Act respecting labour standards, sections 79.16, 79.1 and 79.7.",
  
  "specific_situation.R27":"However, an employee may not take advantage of such a period of absence if it may be inferred from the circumstances that the employee was probably a party to the criminal offence or probably contributed to the injury by a gross fault.\nReference: Act respecting labour standards, section 79.1.1.\nReference: https://www.cnesst.gouv.qc.ca/en/working-conditions/leave/specific-situations/victims-crime",
  
  "specific_situation.R28":"The employee must advise as soon as possible when he or she is to be absent from work as a result of being a victim of a crime.\nYou have the right to ask the employee to provide a document attesting to the reason for the absence,  If it is warranted by the duration of the absence or its repetitive nature, for instance. \nReference: Act respecting labour standards, section 79.2.",
  
  "specific_situation.R29":"The employee's regular position and related benefits are protected for the duration of the employee's absence as a result of being a victim of a crime, which includes but is not limited to:",
  
  "specific_situation.R30":"- The employee’s participation in the group insurance and pension plans recognized in the employee’s place of employment \n - Retention of the same rights and benefits in the event of dismissals or layoffs that would have included if the employee had he or she remained at work\n - Reinstatement of the employee to his or her regular position, with the same benefits to which the employee would have been entitled had the employee remained at work at the end of the period of absence (e.g.: wages).\n If the position held by the employee no longer exists upon his or her return, the employer must recognize all the rights and privileges to which the employee would have been entitled if the employee had been at work at the time the position ceased to exist.\n Reference: Act respecting labour standards, sections 79.3, 79.4, 79.5.",
  
  "statutory_holiday.R1":"It's generally recommended, but not required by law, but not required by law,  to write a policy on absences and leaves, and make sure to communicate it to all the employees.\n Make sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. The policy should include: \n  General goals of the policy\n  Roles and responsibilities of the parties\n  General conditions for taking leave from work\n  Rules and procedures, i.e.: \n  - Employee's obligations (e.g.: to notify the supervisor in advance)\n  - Concrete actions to be taken \n  - Documents to be completed or provided\n  - Deadlines for taking actions\n  - Possible disciplinary sanctions in case of non-compliance",
  
  "statutory_holiday.R2":"Make sure that your policy replicates the rules concerning statutory holidays.",
  
  "statutory_holiday.R3":"According to the law, the following days are statutory general holidays in Quebec.\n 1. January 1 (New Year's Day);\n 2. Good Friday or Easter Monday, at the option of the employer;\n 3. The Monday preceding May 25 (National Patriots' Day);\n 4. July 1 or, if that date falls on a Sunday, July 2 (Canada Day).\n 5. The first Monday in September (Labour Day).\n 6. The second Monday in October (Thanksgiving). \n 7. December 25 (Christmas Day).\n June 24 (National Holiday) is also a statutory holiday according to section 2 of the National Day Act.\nReference: https://www.cnesst.gouv.qc.ca/en/working-conditions/leave/statutory-holidays/statutory-holidays \nReference: Act respecting labour standards, section 60. ",
  
  "statutory_holiday.R4":"Yes, an employee may work on a statutory holiday (ALS, 63). Here are the conditions that apply under the law.",
  
  "statutory_holiday.R5":"Some organizations may remain in operation on statutory general holidays due to the nature of their business.\nYou can ask your employee to work on a statutory holiday if your company qualifies in the business mentioned below: \n - An organization that provides an essential service (e.g., hospitals, public transportation, cabs)\n - An organization with a service that must be maintained (e.g., convenience stores, oil refineries, gas stations)\nReference: https://www.cnesst.gouv.qc.ca/en/working-conditions/leave/statutory-holidays/statutory-holidays",
  
  "statutory_holiday.R6":"An employee is entitled to a statutory holiday, non-working and with pay, regardless of employment status (e.g., full-time, part-time, temporary, on call, casual). \n Therefore, employment status does not effect an employee's right to receive an indemnity for a statutory general holiday or a compensatory day off.\nReference: https://www.cnesst.gouv.qc.ca/en/working-conditions/leave/statutory-holidays/statutory-holidays ",
  
  "statutory_holiday.R7":"You have an obligation to pay the statutory holiday indemnity even if it falls during the employee's annual vacation. \nAs a matter of fact, even if the statutory holiday falls during the annual vacation or on a day that does not coincide with the employee's regular work schedule, the employer must pay the employee indemnity for the holiday or give the employee one day's compensatory holiday with pay on a date agreed to by the employer and the employee.\nReference: Act respecting labour standards, sections 62 and 64.",
  
  "statutory_holiday.R8":"An employee who works on a statutory holiday must receive pay for the day worked. \nThe employee is also entitled to the statutory holiday's indemnity provided for by law or to a paid compensatory holiday of one day, at the employer's choice. \nIf the employer grants a compensatory holiday, it must be taken within 3 weeks before or after the holiday (except for the National Day). \nIt should be noted that an employee whose holiday is a non-working day must also receive the indemnity.\nReference: Act respecting labour standards, section 63.",
  "statutory_holiday.R9":"For each statutory general holiday, the employer must pay the employee an indemnity.\n The indemnity is equal to 1/20 of the wages earned during the 4 complete weeks of pay preceding the week of the holiday, excluding overtime.\n For the person remunerated in whole or in part by commission, the indemnity is equal to 1/60 of the wages earned during the 12 complete weeks of pay preceding the week of the holiday.\n Reference: Act respecting labour standards, section 62.",
  "statutory_holiday.R10":"According to the law, to benefit from a statutory general holiday, with the indemnity, the employee must not have been absent from work without the employer’s authorization or without valid cause on the working day preceding or following the statutory holiday.\nReference: Act respecting labour standards, section 65.",
  "statutory_holiday.R11":"The calculation of the indemnity for each statutory general holiday is done in the same way as for the compensation for days of paid absences, namely:\n 1/20 of the wages earned during the 4 complete weeks of pay preceding the week of the holiday, excluding overtime.\n 1/60 of the wages earned during the 12 complete weeks of pay preceding the week of the holiday for the person remunerated in whole or in part by commission.\n Reference : Act respecting labour standards, section 62.",
  
  "statutory_holiday.R12":"The calculation of a statutory holiday indemnity is done in two steps. \n Step 1: Calculation of the wages earned during the 4 complete weeks of pay preceding the week of the statutory holiday\n Step 2: Calculation of a statutory holiday indemnity",
  
  "statutory_holiday.R13":"To obtain an estimate of the indemnity to be paid for an employee's statutory holiday, you can refer to the CNESST's online tool moncalcul (in english). \n https://www.cnesst.gouv.qc.ca/en/node/1117496/moncalcul",
  
  "statutory_holiday.R14":"Step 1: Calculation of the wages earned during the 4 complete weeks of pay preceding the week of the statutory holiday\nThe first step is to calculate the wages made in the 4 complete weeks of pay preceding the week of the holiday excluding any paid overtime.\nThe formula for making the calculation is as follows: \n(wages earned in a pay week) x 4 complete weeks ",
  
  "statutory_holiday.R15":"Step 2: Calculation of a statutory holiday indemnity\n The second step is to calculate the indemnity to be paid for the holiday. \n The formula for performing the calculation is as follows: \n (1/20) x (wages earned in a pay week) x 4 complete weeks",
  
  "statutory_holiday.R16":"Disclaimer\n Please note that the calculation does not take into account tax deductions and employer bonuses.\n Please also note that overtime, bonuses and premiums are not counted in the calculation of a statutory holiday indemnity",
  
  "statutory_holiday.R17":"Finally, for the statutory holiday in question, please do not neglect to pay the employee if applicable:\n - Wages or pay for work performed on the holiday\n - Overtime for work performed on the holiday\n - Statutory holiday indemnity"

  
  
}