{
  "work_schedule.R1":"It's generally recommended, but not required by law, to write a policy on working hours, breaks and lunch time and make sure to communicate it to all the employees.\nMake sure to update the policy whenever needed and communicate to employees all the updates and modifications, if any. \nMake sure that your policy replicates the rules concerning working hours, breaks and lunch time.",
  
  "work_schedule.R2":"According to the law, an employee is considered to be at work, and must be paid, in the following cases:\n 1. while available to the employer at the place of employment and required to wait for work to be assigned\n 2. during the break periods granted by the employer; (excluding meal breaks)\n 3. when travel is required by the employer\n 4. during any trial period or training required by the employer\n Reference: Act respecting labour standards, section 57.",
  
  "work_schedule.R3":"According to the law, if an employee who reports for work at his place of employment, at the express demand of his employer or in the regular course of his employment and works fewer than three consecutive hours, is entitled to an indemnity equal to three hours’ wages at the prevailing hourly rate.\n The above provision does not apply in the following cases:\n - in the case of superior force (e.g.: fire)\n - the nature of the work or the conditions of its execution require the employee to be present several times in the same day for less than three hours each time (e.g.: a school bus driver) \n - the nature of the work or the conditions of its execution are such that it is ordinarily completed within a three-hour period (e.g.: a school-crossing guard)\n - the overtime worked, the presence of a collective agreement or a decree entitles him or her a greater amount.\n Reference: Act respecting labour standards, section 58.",
  
  "work_schedule.R4":"According to the law, beyond a period of five consecutive hours of work, the employer must grant to the employee a rest period of thirty minutes, without pay, for meals break.\nThe meal break period shall be remunerated if the employee is not authorized to leave his or her workstation in certain cases (e.g., a security guard monitoring a building).\n Reference: Act respecting labour standards, section 79.",
  
  "work_schedule.R5":"There is no legal obligation to give the employee a coffee break. \n However, if you authorize a coffee break, you must remunerate it.\n Reference: Act respecting labour standards, section 57.",
  
  "work_schedule.R6":"According to the law, an employee is entitled to a weekly minimum rest period of 32 consecutive hours, except where a staggering of working hours employees on a basis other than a weekly basis is authorized by the Commission, by a collective agreement, a decree or an agreement signed with the employee. \n Reference: Act respecting labour standards, sections 78 and 53.",
  
  "work_schedule.R7":"According to the law, for the majority of workers, the standard work week is 40 hours. Beyond 40 hours, the worker is deemed to work overtime.\n The standard work week is used to calculate the worker's overtime pay at a premium rate during a week. \n The standard work week is therefore not an invitation for the worker to refuse to work beyond 40 hours.\n Reference: Act respecting labour standards, section 52.",
  
  "work_schedule.R8":"However, for some categories of workers, the standard work week is different due to government regulations. For example, the standard work week is\n - 44 hours for security guards who guard a property on behalf of a security firm\n - 47 hours for workers in a logging or sawmill operation\n - 55 hours for workers who work in a remote area or in the James Bay territory \n - 60 hours for security guards who do not work for a security firm\n Reference: https://www.cnesst.gouv.qc.ca/en/working-conditions/work-schedule-and-termination-employment/work-schedule/standard-work-week",
  
  "work_schedule.R9":"According to the law, for the majority of workers, the standard work week is 40 hours. Beyond 40 hours, the worker is deemed to work overtime.\n The standard work week is used to calculate the worker's overtime pay at a premium rate during a week. \n The standard work week is not an invitation for the worker to refuse to work beyond 40 hours.\n Reference: Act respecting labour standards, section 52.",
  
  "work_schedule.R10":"Overtime shall be calculated at a premium rate of 50% (time and a half) of the employee's regular hourly wage for the week, excluding premiums computed on an hourly basis. \n Overtime pay is calculated as follows: overtime hour x (base wage x 1.50) \n For the calculation of overtime, you should not count premiums established on an hourly basis (e.g., night or evening premiums). \n Reference: Act respecting labour standards, section 55.",
  
  "work_schedule.R11":"For the purposes of computing overtime, annual leave and statutory general holidays with pay are counted as days of work.\n This provision does not apply if the employee does not normally work on the statutory holiday in question. \n Reference: Act respecting labour standards, section 56.",
  
  "work_schedule.R12":"The standard work week (40 hours) does not apply, as regards the computing of overtime hours for the purpose of the increase in the usual hourly wage, to the following employees: \n - students employed in a vacation camp or in a social or community non-profit organization such as a recreational organization\n - senior management employees \n - employees who work outside an establishment whose working-hours cannot be controlled\n - employees assigned to canning, packaging and freezing fruit and vegetables during the harvesting period\n - employees of fishing, fish processing or fish canning industry\n - farm workers\n - employees whose exclusive duty is to take care of or provide care to a child or to a sick, handicapped or aged person, in that person’s dwelling, including, where so required, the performance of domestic duties that are directly related to the immediate needs of that person, unless the work serves to procure profit to the employer\n However, these workers must be paid for hours worked in excess of 40 hours per week, but without the premium rate.\n Reference: Act respecting labour standards, section 54.",
  
  "work_schedule.R13":"According to the law, an employee may refuse to work: \n - more than 2 hours after regular daily working hours or more than 14 working hours per 24-hour period, whichever period is the shortest \n - for an employee whose daily working hours are flexible or non-continuous, more than 12 working hours per 24\n-hour period\n- more than 50 working hours per week, for most employees, unless there is an agreement to stagger the employee's hours of work on a basis other than a weekly basis\n- more than 60 working hours per week, for an employee working in an isolated area or carrying out work in the James Bay territory, unless there is an agreement to stagger the employee's hours of work on a basis other than a weekly basis\n- if he was not informed at least five days in advance that he would be required to work, unless the nature of his duties requires him to remain available (ex., a farm worker or an on-call worker)\n Reference: Act respecting labour standards, section 59.0.1.",
  
  "work_schedule.R14":"However, the law states that an employee cannot refuse to work: \n - if there is a danger to the life, health or safety of employees or the population\n - if there is a risk of destruction or serious deterioration of movable or immovable property \n - in any other case of superior force\n - if the refusal is inconsistent with the employee’s professional code of ethics.\n Reference: Act respecting labour standards, section 59.0.1.",
  
  "work_schedule.R15":"According to the law, for the majority of employees, the standard work week is 40 hours. Beyond 40 hours, the worker is deemed to work overtime.\n However, an employer may, with the authorization of the CNESST, stagger the working hours of work of his employees according to a reference period other than the standard work week which is on a weekly basis. \n Thus, for the calculation of overtime, you will be able to stagger work hours of its employees over several weeks (e.g.: 8 weeks instead of 1 week). \n However, the staggering of employees' hours of work must meet certain conditions, including that the average of the working hours must be equivalent to the standard provided for in law which is 40 hours for most workers. \n Otherwise, you will have to pay overtime.\n Reference: Act respecting labour standards, sections 52 and 53.",
  
  "work_schedule.R16":"To proceed with staggered work hours you must:\n- obtain the agreement of the CNESST or \n- if it is permitted by a collective agreement or a government decree, to stagger work hours \nIt is also possible to make an individual agreement, with an employee, for the staggering of working hours but for not a longer period than 4 weeks.\nReference: Act respecting labour standards, sections 52 and 53.",
  
  "work_schedule.R17":"CNESST authorization to stagger work hours for a group of employees: \nTo stagger the work hours of all their workers over several weeks, you must apply to the CNESST for authorization. \nThe CNESST will ask you to:\n - show that your company carries on its activities under special conditions \n - indicate the benefits for your workers \n - show that the workers are aware of the benefits \n - provide the signature of most of the staff concerned (50% + 1) \n - prove that the application is not a way of avoiding paying overtime at time and a half to the employee\n - post the application and the certificate of authorization in the workplace \n - stagger the hours over a maximum period of 8 weeks \n - notify the CNESST of a new hire if the percentage of workers who agreed to staggered work hours is no longer equivalent to the majority \n The application for authorization must be submitted to the CNESST at least 2 months before the requested start date of the staggered hours. \n While your application is being processed, you must pay the employee overtime. The initial authorization is valid for 1 year and the renewal is valid for 3 years.",
  
  "work_schedule.R18":"Here is the link to the application form for staggered work hours (in French only) :\nhttps://www.cnesst.gouv.qc.ca/fr/organisation/documentation/formulaires-publications/demande-dautorisation-detalement-heures-travail",
  
  "work_schedule.R19":"Individual agreement between an individual employee and the employer:\n The employer and the employee may also agree on the staggering of working hours on a basis other than a weekly basis, without the authorization provided without the need for CNESST authorization. \n However, conditions apply: \n - the average of the working hours must be equivalent to the standard provided for in the law or the regulations\n - the agreement must be evidenced in writing and provide for the staggering of the working hours over a maximum period of four weeks\n - a work week may not exceed the standard provided for in the law or the regulations by more than 10 hours\n - either the employee or the employer may terminate the agreement with notice of at least two weeks before the expected end of the staggering period agreed upon\n Reference: Act respecting labour standards, section 53.",
  
  "work_schedule.R20":"According to the law, you may employ workers under 18 years of age in their company, but certain conditions apply depending on their age and situation. Furthermore, an employer may not ask a minor to perform work that exceeds their abilities or that might: \n - Compromise their education \n - Adversely affect their health or physical or moral development\n To hire a young person who is under 14 years of age, an employer must obtain written authorization from one of their parents or their guardian. The employer must keep this authorization for 3 years as if it were an entry in their company register.\n Reference: Act respecting labour standards, section 84.2 to 84.7.",
  
  "work_schedule.R21":"School attendance\n Also, the employer of a young person who is required to go to school in accordance with the Loi sur l’instruction publique must ensure that their work schedule does not prevent them from attending class. \n This means that a young person may not work during school hours if they: \n - Are under 16 years of age and do not have their Secondary 5 diploma \n - Turn 16 during the school year. In this case, they must go to school until the last day of the school calendar",
  
  "work_schedule.R22":"You must also make sure that the young person’s work schedule allows them to be at home between 11 p.m. on one day and 6 a.m. on the following day, even on weekends or in the summer, unless they are no longer required to go to school.",
  
  "work_schedule.R23":"The law does not require you to provide cigarette breaks to employees who smoke cigarettes. \n The frequency and duration of cigarette breaks, or even coffee breaks, are at your discretion. \n However, when you allow a cigarette break, you must pay for it since the employee is at your disposal and remains in the workplace.\n Reference: Act respecting labour standards, section 57.",
  
  "work_schedule.R24":"To avoid abuse of cigarette breaks, it is strongly recommended that you draft a policy governing the taking of cigarette breaks, or even coffee breaks, in your company.\n Such a policy is not required by law. Nonetheless, it helps avoid ambiguities and ensure effective management of work breaks.",
  
  "work_schedule.R25":"In this policy, you must communicate to employees the obligations and expectations regarding taking cigarette breaks (e.g., length and frequency of breaks). \n You must also make it clear that abuse of cigarette breaks will not be tolerated and will be increasingly punished, up to and including dismissal. \n Make sure to communicate the policy to all employees. Also, be sure to communicate to employees any updates and changes to the policy, if any."
  
  
}